Revit 2027 API
ScheduleDefinition.RemoveField Method
Overload List
Name | Description
RemoveField(Int32) |  Removes a field.
RemoveField(ScheduleFieldId) |  Removes a field.
Top
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace